simonmorley/Arduino/hardware/arduino/samd/boards.txt
#ARDUINO ZERO PRO - PROGRAMMING PORT
arduino_zero_pro_dbg.name=Arduino Zero Pro (Programming Port)
arduino_zero_pro_dbg.vid.0=0x03eb
arduino_zero_pro_dbg.pid.0=0x2111
arduino_zero_pro_dbg.upload.tool=openocd
arduino_zero_pro_dbg.upload.protocol=sam-ba
arduino_zero_pro_dbg.upload.maximum_size=262144
arduino_zero_pro_dbg.upload.use_1200bps_touch=false
arduino_zero_pro_dbg.upload.wait_for_upload_port=false
arduino_zero_pro_dbg.upload.native_usb=false
arduino_zero_pro_dbg.build.mcu=cortex-m0plus
arduino_zero_pro_dbg.build.f_cpu=48000000L
arduino_zero_pro_dbg.build.usb_product="Arduino Zero"
arduino_zero_pro_dbg.build.board=SAM_ZERO
arduino_zero_pro_dbg.build.core=arduino
arduino_zero_pro_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_zero_pro_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_pro_dbg.build.variant=arduino_zero
arduino_zero_pro_dbg.build.variant_system_lib=
arduino_zero_pro_dbg.build.vid=0x2a03
arduino_zero_pro_dbg.build.pid=0x004d
arduino_zero_pro_dbg.build.section.start=0x0000

arduino_zero_pro_dbg.bootloader.tool=openocd
#arduino_zero_pro_dbg.bootloader.low_fuses=0xff
#arduino_zero_pro_dbg.bootloader.high_fuses=0xd8
#arduino_zero_pro_dbg.bootloader.extended_fuses=0xfb
arduino_zero_pro_dbg.bootloader.file=zero/bootloader_stk500v2_beta.hex.hex
#arduino_zero_pro_dbg.bootloader.unlock_bits=0x3F
#arduino_zero_pro_dbg.bootloader.lock_bits=0x2F

#ARDUINO ZERO PRO - NATIVE PORT
#arduino_zero_pro.name=Arduino Zero Pro (Native USB Port)
#arduino_zero_pro.vid.0=0x2a03
#arduino_zero_pro.pid.0=0x004d
#arduino_zero_pro.vid.1=0x2341
#arduino_zero_pro.pid.1=0x804d
#arduino_zero_pro.upload.tool=avrdude
#arduino_zero_pro.upload.protocol=stk500v2
#arduino_zero_pro.upload.maximum_size=262144
#arduino_zero_pro.upload.use_1200bps_touch=false
#arduino_zero_pro.upload.wait_for_upload_port=false
#arduino_zero_pro.upload.native_usb=true
#arduino_zero_pro.upload.speed=57600
#arduino_zero_pro.build.mcu=cortex-m0plus
#arduino_zero_pro.build.f_cpu=48000000L
#arduino_zero_pro.build.usb_product="Arduino Zero"
#arduino_zero_pro.build.board=SAM_ZERO
#arduino_zero_pro.build.core=arduino
#arduino_zero_pro.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
#arduino_zero_pro.build.ldscript=linker_scripts/gcc/flash.ld
#arduino_zero_pro.build.variant=arduino_zero
#arduino_zero_pro.build.variant_system_lib=
#arduino_zero_pro.build.vid=0x2a03
#arduino_zero_pro.build.pid=0x004d
#arduino_zero_pro.build.section.start=0x0000
#arduino_zero_pro.build.emu.mcu=atmega2560

#arduino_zero_pro.name=Arduino Zero Pro (Native USB Port)
#arduino_zero_pro.vid.0=0x2341
#arduino_zero_pro.pid.0=0x004d
#arduino_zero_pro.vid.1=0x2341
#arduino_zero_pro.pid.1=0x804d
#arduino_zero_pro.upload.tool=openocd
#arduino_zero_pro.upload.protocol=sam-ba
#arduino_zero_pro.upload.maximum_size=262144
#arduino_zero_pro.upload.use_1200bps_touch=false
#arduino_zero_pro.upload.wait_for_upload_port=false
#arduino_zero_pro.upload.native_usb=true
#arduino_zero_pro.upload.speed=57600
#arduino_zero_pro.build.mcu=cortex-m0plus
#arduino_zero_pro.build.f_cpu=48000000L
#arduino_zero_pro.build.usb_product="Arduino Zero"
#arduino_zero_pro.build.board=SAM_ZERO
#arduino_zero_pro.build.core=arduino
#arduino_zero_pro.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
#arduino_zero_pro.build.ldscript=linker_scripts/gcc/flash.ld
#arduino_zero_pro.build.variant=arduino_zero
#arduino_zero_pro.build.variant_system_lib=
#arduino_zero_pro.build.vid=0x2a03
#arduino_zero_pro.build.pid=0x804d
#arduino_zero_pro.build.section.start=0x0000
#arduino_zero_pro.build.emu.mcu=atmega2560

#ARDUINO ZERO PRO BOOTLOADER - PROGRAMMING PORT
arduino_zero_pro_bl_dbg.name=Arduino Zero Pro with Bootloader (Programming Port)
arduino_zero_pro_bl_dbg.vid.0=0x03eb
arduino_zero_pro_bl_dbg.pid.0=0x2111
arduino_zero_pro_bl_dbg.upload.tool=openocd
arduino_zero_pro_bl_dbg.upload.protocol=sam-ba
arduino_zero_pro_bl_dbg.upload.maximum_size=262144
arduino_zero_pro_bl_dbg.upload.use_1200bps_touch=false
arduino_zero_pro_bl_dbg.upload.wait_for_upload_port=false
arduino_zero_pro_bl_dbg.upload.native_usb=false
arduino_zero_pro_bl_dbg.build.mcu=cortex-m0plus
arduino_zero_pro_bl_dbg.build.f_cpu=48000000L
arduino_zero_pro_bl_dbg.build.usb_product="Arduino Zero"
arduino_zero_pro_bl_dbg.build.board=SAM_ZERO
arduino_zero_pro_bl_dbg.build.core=arduino
arduino_zero_pro_bl_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl_dbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_pro_bl_dbg.build.variant=arduino_zero
arduino_zero_pro_bl_dbg.build.variant_system_lib=
arduino_zero_pro_bl_dbg.build.vid=0x2a03
arduino_zero_pro_bl_dbg.build.pid=0x004d
arduino_zero_pro_bl_dbg.build.section.start=0x4000

#ARDUINO ZERO PRO BOOTLOADER - NATIVE PORT
arduino_zero_pro_bl.name=Arduino Zero Pro with Bootloader (Native USB Port)
arduino_zero_pro_bl.vid.0=0x2a03
arduino_zero_pro_bl.pid.0=0x004d
arduino_zero_pro_bl.vid.1=0x2a03
arduino_zero_pro_bl.pid.1=0x804d
arduino_zero_pro_bl.upload.tool=avrdude
arduino_zero_pro_bl.upload.protocol=stk500v2
arduino_zero_pro_bl.upload.maximum_size=262144
arduino_zero_pro_bl.upload.use_1200bps_touch=true
arduino_zero_pro_bl.upload.wait_for_upload_port=true
arduino_zero_pro_bl.upload.native_usb=true
arduino_zero_pro_bl.upload.speed=57600
arduino_zero_pro_bl.build.mcu=cortex-m0plus
arduino_zero_pro_bl.build.f_cpu=48000000L
arduino_zero_pro_bl.build.usb_product="Arduino Zero"
arduino_zero_pro_bl.build.board=SAM_ZERO
arduino_zero_pro_bl.build.core=arduino
arduino_zero_pro_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_pro_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_pro_bl.build.variant=arduino_zero
arduino_zero_pro_bl.build.variant_system_lib=
arduino_zero_pro_bl.build.vid=0x2a03
arduino_zero_pro_bl.build.pid=0x804d
arduino_zero_pro_bl.build.section.start=0x4000
arduino_zero_pro_bl.build.emu.mcu=atmega2560

#arduino_zero_pro_bl.bootloader.tool=avrdude
#arduino_zero_pro_bl.bootloader.low_fuses=0xff
#arduino_zero_pro_bl.bootloader.high_fuses=0xd8
#arduino_zero_pro_bl.bootloader.extended_fuses=0xfb
#arduino_zero_pro_bl.bootloader.file=zero/bootloader_stk500v2_beta.hex
#arduino_zero_pro_bl.bootloader.unlock_bits=0x3F
#arduino_zero_bl.bootloader.lock_bits=0x2F